{
  "title": "PHP",
  "slug": "/php",
  "resources": [
    {
      "title": "PHP the right way",
      "desc": "PHP The Right Way is an easy-to-read, quick reference for PHP popular coding standards, links to authoritative tutorials around the Web and what the contributors consider to be best practices at the present time.",
      "url": "https://phptherightway.com",
      "tags": ["book", "guide", "resources", "virtualization"]
    },
    {
      "title": "The PHP manual",
      "desc": "The PHP manual is documenting the whole spec while giving examples for each property.",
      "url": "https://www.php.net/manual/en/",
      "tags": ["manual", "examples", "current", "security", "configuration"]
    },
    {
      "title": "Laracasts",
      "desc": "Learn practical, modern web development, through expert screencasts on Laravel, Vue, and so much more.",
      "url": "https://laracasts.com",
      "tags": ["series", "search", "tooling", "testing"]
    },
    {
      "title": "An online book for learning PHP",
      "desc": "PHP Apprentice is an online, open source book about the PHP programming language. PHP is one of the most popular platforms for building websites and web services.",
      "url": "https://phpapprentice.com/",
      "tags": ["basics", "installing"]
    },
    {
      "title": "PHP-FIG",
      "desc": "Moving PHP forward through collaboration and standards. Welcome to the PHP Framework Interop Group! We're a group of established PHP projects whose goal is to talk about commonalities between our projects and find ways we can work better together.",
      "url": "https://www.php-fig.org/",
      "tags": ["blog", "bylaws", "standards", "styles", "interfaces"]
    },
    {
      "title": "(The only proper) PDO tutorial",
      "desc": "There are many tutorials on PDO already, but unfortunately, most of them fail to explain the real benefits of PDO, or even promote rather bad practices. The only two exceptions are phptherightway.com and hashphp.org, but they miss a lot of important information. As a result, half of PDO's features remain in obscurity and are almost never used by PHP developers, who, as a result, are constantly trying to reinvent the wheel which already exists in PDO.",
      "url": "https://phpdelusions.net/pdo",
      "tags": ["database", "security", "usability", "reliability"]
    },
    {
      "title": "Online PHP shell",
      "desc": "3v4l.org (leetspeak for eval) is an online shell that allows you to run your code on my server. I compiled more than 200 different PHP versions (every version released since 4.3.0) plus HHVM for you to use.",
      "url": "https://3v4l.org/",
      "tags": ["versions", "performance", "output", "testing"]
    },
    {
      "title": "Safe Password Hashing",
      "desc": "This section explains the reasons behind using hashing functions to secure passwords, as well as how to do so effectively.",
      "url": "https://www.php.net/manual/en/faq.passwords.php",
      "tags": ["security", "storage", "salt"]
    },
    {
      "title": "14 Tips",
      "desc": "14 Tips to Write PHP Code that is Hard to Maintain and Upgrade",
      "url": "https://www.tomasvotruba.cz/blog/2018/11/26/14-tips-to-write-php-code-that-is-hard-to-maintain-and-upgrade/",
      "tags": ["sarcastic", "vendor", "bad", "incorrect"]
    },
    {
      "title": "Object Calisthenics",
      "desc": "Object Calisthenics are programming exercises, formalized as a set of 9 rules invented by Jeff Bay in his book The ThoughtWorks Anthology. The word Object is related to Object Oriented Programming. The word Calisthenics is derived from greek, and means exercises under the context of gymnastics.",
      "url": "https://williamdurand.fr/2013/06/03/object-calisthenics/",
      "tags": ["rules", "maintainability", "readability", "testability"]
    },
    {
      "title": "Your code sucks, let's fix it",
      "desc": "134 Slides to help fix your code. Performance and testing are just one aspect of code, to really be successful your code needs to be readable, maintainable and generally easier to comprehend and work with.",
      "url": "https://www.slideshare.net/rdohms/your-code-sucks-lets-fix-it-15471808",
      "tags": ["slides", "readability", "rules"]
    },
    {
      "title": "Clean Code PHP",
      "desc": "Software engineering principles, from Robert C. Martin's book Clean Code, adapted for PHP.",
      "url": "https://github.com/jupeter/clean-code-php",
      "tags": ["book", "guide", "rules", "standards"]
    }
  ]
}
